app/views/forums/index.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."id" DESC LIMIT $2  [["category_id", 1], ["LIMIT", 4]]
---
  <% for category in @categories do%>
    <% posts = Post.where(category_id: category.id).last(4) %>