app/views/favourites/_favourite.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
<% post = Post.find(favourite.post.id) %>