app/views/commentaries/_commentary.html.erb

          <% if commentary.user %>
            <%= link_to(profile_path({id: User.find(commentary.user_id).id}), method: :patch) do %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

      <% if user_signed_in? %>
        <% @post = Post.find(Commentary.find_parent_id(commentary)) %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "commentaries".* FROM "commentaries" WHERE "commentaries"."post_id" = $1  [["post_id", 20]]