app/views/posts/_post.html.erb

SELECT "favourites".* FROM "favourites" WHERE "favourites"."post_id" = '20' AND "favourites"."user_id" = '1'
---
          <%if user_signed_in?()%>
            <% if Favourite.where(post: post, user: current_user).length() != 0 %>

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <% end%>
            <% @category = Category.find(post.category_id) %>