app/views/posts/new.html.erb

      <% f.label(:category) %><br />
      <% f.collection_select(:category, Category.all, :id , :name ,{prompt: 'Select a Forum',include_blank: "Please select", class: "form-control"}) %>
---
SELECT "categories".* FROM "categories"