app/views/posts/show.html.erb

            <% if @post.user %>
              <%= link_to(profile_path({id: User.find(@post.user_id).id}), method: :patch) do %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

<script type="text/javascript">
  $('#uploader').cloudinary_upload_widget(
    {cloud_name: 'hctj9u4ot',
     upload_preset: 'commentary',
     cropping: 'server',
     folder: 'commentaries',
     theme: 'minimal',
     button_class: "btn btn-default",
     button_caption: "Subir imagen",
     max_image_width: 400,
     max_image_height: 400},
    function(error, result) {
      $('#commentary_text')[0].value += '![](' +  result["0"]['secure_url'] + ') '
     });
---
SELECT "commentaries".* FROM "commentaries" WHERE "commentaries"."post_id" = $1  [["post_id", 1]]