app/controllers/commentaries_controller.rb

INSERT INTO "commentaries" ("text", "created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "asdasdasd"], ["created_at", "2018-06-09 00:51:48.132839"], ["updated_at", "2018-06-09 00:51:48.132839"], ["user_id", "1"], ["post_id", 20]]
---
  def create
    if params.key?('commentary')
      new_comentary = Commentary.create(
        post_id: params['commentary']['post_id'],
        text: params['commentary']['text'],
        user_id: params['commentary']['user_id']
      )

SELECT  "commentaries".* FROM "commentaries" WHERE "commentaries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def like
    @commentary = Commentary.find(params[:id])

SELECT  "commentaries".* FROM "commentaries" WHERE "commentaries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def dislike
    @commentary = Commentary.find(params[:id])