app/controllers/communities_controller.rb

  def show
    @posts = Post.where(category_id: params[:id]).last(100)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."id" DESC LIMIT $2  [["category_id", 1], ["LIMIT", 100]]