app/controllers/favourites_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "favourites".* FROM "favourites" WHERE ("favourites"."user_id" = $1 OR "favourites"."user_id" = '1')  [["user_id", "1"]]
---
  def index
    @subscriptions = current_user.subscriptions
    @favourites = current_user.favourites

    @posts = Post.where(id: @favourites.map { |a| a['post_id'] })

INSERT INTO "favourites" ("user_id", "post_id") VALUES ($1, $2) RETURNING "id"  [["user_id", "1"], ["post_id", "20"]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    new_favourite = Favourite.create()
    new_favourite.user = current_user
    new_favourite.post = Post.find(params['post_id'])

SELECT  "favourites".* FROM "favourites" WHERE "favourites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "favourites" SET "isSubcribe" = $1 WHERE "favourites"."id" = $2  [["isSubcribe", "t"], ["id", 1]]
---
  def subscribe
    favourite = Favourite.find(params['format'])
    if current_user == favourite.user
      favourite.isSubcribe = !favourite.isSubcribe
      favourite.save()

DELETE FROM "favourites" WHERE "favourites"."post_id" = $1 AND "favourites"."user_id" = $2  [["post_id", "15"], ["user_id", "1"]]
---
  def delete
    Favourite.where(post_id: params['post_id'], user: current_user).delete_all()