app/controllers/favourites_controller.rb

  def index
    @favourites = Favourite.select(:post_id).distinct.where(user_id: current_user.id)
---
SELECT DISTINCT "favourites"."post_id" FROM "favourites" WHERE "favourites"."user_id" = $1  [["user_id", "1"]]