app/controllers/forums_controller.rb

  def index
    @posts = Post.all()
    if params['order'] == 'tiempo'
      @posts =  Post.sort_by_date(@posts)
    elsif params['order'] == 'puntos'
      @posts =  Post.sort_by_points(@posts)
    else
      @posts =  Post.sort_by_trends(@posts)
    end
    @posts = @posts.paginate(page: params[:page], per_page: 6)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def mostrar
    @post = Post.find(params[:id])
    @comentarios = Commentary.where(post_id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "commentaries".* FROM "commentaries" WHERE "commentaries"."post_id" = $1  [["post_id", 20]]