app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "commentaries".* FROM "commentaries" WHERE "commentaries"."post_id" = $1  [["post_id", 20]]
---
  def show
    @post = Post.find(params[:id])
    @comentarios = Commentary.where(post_id: params[:id]).sort_by { |x| x.get_likes.size }.reverse!

INSERT INTO "posts" ("title", "content", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cat"], ["content", ":smile: "], ["category_id", 3], ["created_at", "2018-04-27 23:00:37.181301"], ["updated_at", "2018-04-27 23:00:37.181301"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def create
    new_category = Post.create(category: Category.find_by(id: params['post']['category']),
                               title: params['post']['title'], content: params['post']['content'])