app/controllers/welcome_controller.rb

SELECT  "posts".* FROM "posts" LIMIT $1  [["LIMIT", 5]]
---
  def index
    @posts = Post.limit(5)